[
    {
        "id": 1,
        "title": "Dark Memory",
        "author": "Christine Feehan",
        "category": "Romance",
        "description": "Safia Meziane has trained since birth to protect her tribe, the family she holds so dear. All along she told herself the legends she was raised with were simply that. But now, she must call upon all of her skills to fight what lies ahead. Evil has come to their small town on the coast of Algeria, evil that Safia can feel but cannot see.",
        "price": 14.99,
        "thumbnail": "https://m.media-amazon.com/images/I/51YkE0EzAWL.jpg",
        "code": "B1",
        "stock": 23
    },
    {
        "id": 2,
        "title": "Fourth Wing",
        "author": "Rebecca Yarros",
        "category": "Fantasy",
        "description": "Suspenseful, sexy, and with incredibly entertaining storytelling, the first in Yarros' Empyrean series will delight fans of romantic, adventure-filled fantasy.' —Booklist, starred review",
        "price": 14.99,
        "thumbnail": "https://images.cdn3.buscalibre.com/fit-in/360x360/4d/28/4d28ac1183866f21e774e25142d9a409.jpg",
        "code": "B2",
        "stock": 15
    },
    {
        "id": 3,
        "title": "V for Vendetta (New Edition",
        "author": "Alan Moore",
        "category": "Comic",
        "description": "A powerful story about loss of freedom and individuality, V FOR VENDETTA takes place in atotalitarian England following a devastating war that changed the face of the planet. In a world without political freedom, personal freedom and precious little faith in anything, comes a mysterious man in a white porcelain mask who fightspolitical oppressors through terrorism and seemingly absurd acts in this gripping tale of the blurred lines between ideological good and evil.",
        "price": 9.2,
        "thumbnail": "https://http2.mlstatic.com/D_NQ_NP_705973-MLA50789601982_072022-O.webp",
        "code": "B3",
        "stock": 7
    },
    {
        "id": 4,
        "title": "Fantastic Beasts and Where to Find Them",
        "author": "J.K. Rowling",
        "category": "Fiction",
        "description": "An approved textbook at Hogwarts School of Witchcraft and Wizardry since its first publication, Fantastic Beasts and Where to Find Them is an indispensable guide to the magical beasts of the wizarding world. It showcases a menagerie of magical creatures, explained enchantingly by noted magizoologist, Newt Scamander, who you may remember from the film series of the same name. The shelves of the Hogwarts Library are also home to many more fascinating books. If you have enjoyed Fantastic Beasts",
        "price": 5.99,
        "thumbnail": "https://m.media-amazon.com/images/I/51XXxJ0uQzL.jpg",
        "code": "B4",
        "stock": 13
    },
    {
        "id": 5,
        "title": "Never Lie",
        "author": "Freida McFadden",
        "category": "Fiction",
        "description": "Newlyweds Tricia and Ethan are searching for the house of their dreams. But when they visit the remote manor that once belonged to Dr. Adrienne Hale, a renowned psychiatrist who vanished without a trace four years earlier, a violent winter storm traps them at the estate... with no chance of escape until the blizzard comes to an end. In search of a book to keep her entertained until the snow abates, Tricia happens upon a secret room. One that contains audio transcripts from every single patient Dr. Hale has ever interviewed. As Tricia listens to the cassette tapes, she learns about the terrifying chain of events leading up to Dr. Hale's mysterious disappearance. Tricia plays the tapes one by one, late into the night. With each one, another shocking piece of the puzzle falls into place, and Dr. Adrienne Hale's web of lies slowly unravels. And then Tricia reaches the final cassette. The one that reveals the entire horrifying truth",
        "price": 41.48,
        "thumbnail": "https://th.bing.com/th/id/OIP.SpEExoJHk49l3HGW5ZoyhgAAAA?pid=ImgDet&rs=1",
        "code": "B5",
        "stock": 17
    },
    {
        "id": 6,
        "title": "Mr. Mercedes",
        "author": "Stephen King",
        "category": "Fiction",
        "description": "A cat-and-mouse suspense thriller featuring a retired homicide detective who's haunted by the few cases he left open, and by one in particular - the pre-dawn slaughter of eight people among hundreds gathered in line for the opening of a jobs fair when the economy was guttering out. Without warning, a lone driver ploughed through the crowd in a stolen Mercedes. The plot is kicked into gear when Bill Hodges receives a letter in the mail, from a man claiming to be the perpetrator. He taunts Hodges with the notion that he will ...",
        "price": 2.07,
        "thumbnail": "https://m.media-amazon.com/images/I/51XXxJ0uQzL.jpg",
        "code": "B6",
        "stock": 10
    },
    {
        "id": 7,
        "title": "Icebreaker",
        "author": "Hannah Grace",
        "category": "Romance",
        "description": "Anastasia Allen has worked her entire life for a shot at Team USA. A competitive figure skater since she was five years old, a full college scholarship thanks to her place on the Maple Hills skating team, and a schedule that would make even the most driven person weep, Stassie comes to win.",
        "price": 11.34,
        "thumbnail": "https://m.media-amazon.com/images/I/713UXYBviuL.jpg",
        "code": "B7",
        "stock": 15
    },
    {
        "id": 8,
        "title": "Little Women",
        "author": "Louisa May Alcott",
        "category": "Fiction",
        "description": "Meg, Jo, Beth, and Amy March are raised in genteel poverty by their loving mother, Marmee, in a quiet Massachusetts town while their father serves as an army chaplain during the American Civil War. They befriend Theodore Lawrence (Laurie), the lonely grandson of a rich old man next door. The vital force of the family is Jo, a headstrong tomboy who is the emotional centre of the book. In the course of the novel, beautiful, vain Meg marries Laurie’s tutor, John Brooke, and starts her own family; quiet, sickly Beth dies from scarlet fever; artistic Amy marries Laurie after he is turned down by Jo; and Jo marries Professor Bhaer, whom she meets while living in a boardinghouse, and together they set up a school for boys.",
        "price": 11.09,
        "thumbnail": "https://i.thenile.io/r1000/9780143135562.jpg?r=5eef7f7030e95",
        "code": "B8",
        "stock": 10
    },
    {
        "id": 9,
        "title": "Me Before You",
        "author": "Jojo Moyes",
        "category": "Romance",
        "description": "Lou Clark knows lots of things. She knows how many footsteps there are between the bus stop and home. She knows she likes working in The Buttered Bun tea shop and she knows she might not love her boyfriend Patrick. What Lou doesn’t know is she’s about to lose her job or that knowing what’s coming is what keeps her sane. Will Traynor knows his motorcycle accident took away his desire to live. He knows everything feels very small and rather joyless now and he knows exactly how he’s going to put a stop to that. What Will doesn’t know is that Lou is about to burst into his world in a riot of colour. And neither of them knows they’re going to change the other for all time.",
        "price": 30.04,
        "thumbnail": "https://th.bing.com/th/id/OIP.HlgosU1XRpKXVWp6ei_zYgHaLP?pid=ImgDet&rs=1",
        "code": "B9",
        "stock": 3
    },
    {
        "id": 10,
        "title": "The Scarlett Letter",
        "author": "Nathaniel Hawthorne",
        "category": "Fiction",
        "description": "Set in 17th-century Puritan Boston, Massachusetts, during the years 1642 to 1649, it tells the story of Hester Prynne, who conceives a daughter through an affair and will not reveal her lover’s identity. The scarlet letter A (for adultery) she has to wear on her clothes, along with her public shaming, is her punishment for her sin and her secrecy. She struggles to create a new life of repentance and dignity. Throughout the book, Hawthorne explores themes of legalism, sin, and guilt.",
        "price": 3.99,
        "thumbnail": "https://th.bing.com/th/id/R.c54d80c29c1b92aa36cf68c1b4ba9e3a?rik=gwDHfJxCT1aNIA&riu=http%3a%2f%2fsoutheastbymidwest.com%2fwp-content%2fuploads%2f2014%2f11%2fThe-Scarlet-Letter-by-Nathaniel-Hawthorne.jpg&ehk=FF9LVUPYOKjO6uvF173xbx5K0jmr%2fHjrsvHdlALNxLs%3d&risl=&pid=ImgRaw&r=0",
        "code": "B10",
        "stock": 18
    }
]